Revit 2026 API

# WallSweepInfoProfileId Property

---

The element id of the profile family used to create the sweep or reveal.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId ProfileId { get; set; }
```
```vb
Public Property ProfileId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ ProfileId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member ProfileId : ElementId with get, set
```

#### Property Value

ElementId May be InvalidElementId if the default profile is used.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

This value is not used when creating standalone wall sweeps. The profile id of the wall sweep's type is used instead.

#### Reference

WallSweepInfo Class

Autodesk.Revit.DB Namespace